languages.tex
% Created 2025-06-23 Mon 15:21
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mayer Goldberg (מֵאִיר גּוֹלְדְּבֵּרְג)}
\date{\today}
\title{Learning Languages}
\hypersetup{
 pdfauthor={Mayer Goldberg (מֵאִיר גּוֹלְדְּבֵּרְג)},
 pdftitle={Learning Languages},
 pdfkeywords={Mayer Goldberg, Department of Computer Science, Ben-Gurion University, learning languages, polyglot},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{How I learn languages}
\label{sec:orga4da55e}

\section{Languages I'm currently learning}
\label{sec:orgdb6a950}
\begin{itemize}
\item \href{./arabic/arabic.html}{Arabic}
\end{itemize}

\section{Languages I wish on learning}
\label{sec:org60f2d0c}
\begin{itemize}
\item Turkish
\item Coptic
\item Syriac
\item Yiddish
\item Vietnamese
\end{itemize}

\section{Languages I've learnt in the past}
\label{sec:org37f02a0}
\begin{itemize}
\item Russian: I've taken two years of Russian as an undergraduate. By the end of my second year, I could speak, read, and write reasonably well for a beginner. The problem is that this was in the US, back in 1987, and it was not easy to find people with whom to converse in Russian\ldots{} I forgot much of my Russian, though I can still manage simple conversations. I do plan on returning to Russian some day.
\item Mandarin Chinese: One summer I studied some Mandarin Chinese in the hope of sitting in on the course at Ben-Gurion university. I practiced the better part of a summer break, and by the end of the break, I was able to engage in simple, short conversations with Chinese speakers [I found on the internet]. But when the Fall semester was about to start, the students declared a strike, and classes were postponed for several weeks. By the time the strike was over I'd had enough on my plate and coulnd't find the time to study.
\item Latin: I took one semester of Latin, and have kept on studying on my own. I don't study it presently, but I do read a bit Latin every now and then.
\item Greek
\item German: I took one semester of German.
\item Hindi
\item Sanskrit
\item Tibetan
\end{itemize}
\section{Interlinear Translations I Prepared}
\label{sec:org1095c82}
\begin{itemize}
\item \href{./psalter.html}{A quadrilingual Psalter}
\end{itemize}
\end{document}
